In [1]:
import pandas as pd

In [5]:
#data=pd.read_csv(r'C:\Users\saket\Desktop\DATASETS\loan2.csv',na_values=['not availabel','n.a.'])#to convrt not avilabel value into NaN value

In [190]:
data=pd.read_csv(r'C:\Users\saket\Desktop\DATASETS\my_data.csv')

In [191]:
data

   ST_ROLLNO ST_NAME  ST_STD ST_DIV ST_ADD  ST_FESS  ST_MARKS
0        100     ABC       5      A     NP    15000        50
1        200     XYZ      -5      B     KA     1600        60
2        300     TYU       3      c     KH     3000       -90
3        400     NYU       2      D     NU    40000       -70
4        500     JKL       1      E     SA  -700000       -80

In [102]:
#a=-data[['ST_FESS']][data['ST_FESS']<0]

In [153]:
-data[['ST_FESS']][data['ST_FESS']<0]

   ST_FESS
4   700000

In [112]:
#data[data['ST_FESS']<0]=-data[['ST_FESS']][data['ST_FESS']<0]<-dataframe

In [131]:
#data[['ST_FESS']][data['ST_FESS']<0]=-data[['ST_FESS']][data['ST_FESS']<0]<-data frame

In [207]:
data['ST_FESS'][data['ST_FESS']<0]=-data['ST_FESS'][data['ST_FESS']<0]#<- series datastrcure

In [168]:
#data

In [208]:
data

   ST_ROLLNO ST_NAME  ST_STD ST_DIV ST_ADD  ST_FESS  ST_MARKS
0        100     ABC       5      A     NP    15000        50
1        200     XYZ      -5      B     KA     1600        60
2        300     TYU       3      c     KH     3000       -90
3        400     NYU       2      D     NU    40000       -70
4        500     JKL       1      E     SA   700000       -80

In [210]:
data['ST_STD'][data['ST_STD']<0]=-data['ST_STD'][data['ST_STD']<0]#<- series datastrcure

In [211]:
data

   ST_ROLLNO ST_NAME  ST_STD ST_DIV ST_ADD  ST_FESS  ST_MARKS
0        100     ABC       5      A     NP    15000        50
1        200     XYZ       5      B     KA     1600        60
2        300     TYU       3      c     KH     3000       -90
3        400     NYU       2      D     NU    40000       -70
4        500     JKL       1      E     SA   700000       -80

In [213]:
data['ST_MARKS'][data['ST_MARKS']<0]=-data['ST_MARKS'][data['ST_MARKS']<0]#<- series datastrcure

In [214]:
data

   ST_ROLLNO ST_NAME  ST_STD ST_DIV ST_ADD  ST_FESS  ST_MARKS
0        100     ABC       5      A     NP    15000        50
1        200     XYZ       5      B     KA     1600        60
2        300     TYU       3      c     KH     3000        90
3        400     NYU       2      D     NU    40000        70
4        500     JKL       1      E     SA   700000        80

In [215]:
data

   ST_ROLLNO ST_NAME  ST_STD ST_DIV ST_ADD  ST_FESS  ST_MARKS
0        100     ABC       5      A     NP    15000        50
1        200     XYZ       5      B     KA     1600        60
2        300     TYU       3      c     KH     3000        90
3        400     NYU       2      D     NU    40000        70
4        500     JKL       1      E     SA   700000        80

In [169]:
b=-4
-b
abs(b)

4